import emailIcon from '../assets/icons/emailIcon.png'
import phoneIcon from '../assets/icons/phoneIcon.png'
import locationIcon from '../assets/icons/locationIcon.png'
import { AgitationalBannerItem } from '../components/ui/List'

import espresso from '../../src/assets/images/espresso.jpg'
import smoothie from "../../src/assets/images/smoothie-avocado-kiwi.jpg"
import special from "../../src/assets/images/hot-chocolate.jpg"
import tea from "../../src/assets/images/black-tea.jpg"


type coffeeGroupsImgLinksType = Map<string, string>
export const coffeeGroupsImgLinks : coffeeGroupsImgLinksType = new Map([["Кава", espresso], ["Чай", tea], ["Спеціальні Напої", special], ["Смузі", smoothie]])

export const SET_ACTIVE_CARD = 'SET_ACTIVE_CARD'
export const SET_COFFEE_GROUPS = 'SET_COFFEE_GROUPS'
export const SET_COFFEE_PRODUCTS_TO_GROUP = 'SET_COFFEE_PRODUCTS_TO_GROUP'
export const SET_ALL_PRODUCTS_LOADED = 'SET_ALL_PRODUCTS_LOADED'
export const SET_RANDOM_CARD = 'SET_RANDOM_CARD'
export const NULL_PRODUCTS_GROUPS = 'NULL_PRODUCTS_GROUPS' 

export interface ShowAllItemsBlockData {
    title? : string,
    btnText? : string
}

export const showAllItemsDefaultValues : ShowAllItemsBlockData = {
    title: "Список усієї нашої кави",
    btnText: "Показати усю каву" 
} 

interface PrivacyPolicyItem {
    title : string,
    text :  string
}

export const COMPANY = 'Fast Coffee'
export const COMPANY_EMAIL = ' fastcoffee@gmail.com'

export const PRIVACY_POLICY_TEXT : PrivacyPolicyItem[] = [
    {title: 'Вступ', text: 'Ця Політика конфіденційності описує, як Fast Coffee ("ми", "наш" або "нас") збирає, використовує та захищає особисту інформацію, яку ви надаєте на нашому веб-сайті fastcoffee.ua ("Сайт"). Використовуючи наш Сайт, ви погоджуєтесь з умовами цієї Політики конфіденційності.'},
    {title: 'Захист інформації', text: `Ми впроваджуємо різноманітні заходи безпеки для захисту вашої особистої інформації. Ваші дані зберігаються на захищених серверах та доступні лише обмеженій кількості осіб, які мають спеціальні права доступу до таких систем і зобов'язані зберігати конфіденційність цієї інформації.`},
    {title : 'Розкриття інформації третім сторонам', text: 'Ми не продаємо, не обмінюємо та не передаємо вашу особисту інформацію третім сторонам без вашої згоди, за винятком випадків, коли це необхідно для надання послуг (наприклад, обробка платежів, доставка замовлень) або коли це вимагається законом.'},
    {title: 'Посилання на інші сайти', text: 'Наш Сайт може містити посилання на інші веб-сайти. Ми не несемо відповідальності за зміст або політику конфіденційності цих сайтів. Рекомендуємо вам ознайомитися з політикою конфіденційності кожного веб-сайту, який ви відвідуєте.'},
    {title: 'Зміни до Політики конфіденційності', text: 'Ми залишаємо за собою право оновлювати цю Політику конфіденційності в будь-який час. Зміни набувають чинності з моменту їх публікації на цій сторінці. Рекомендуємо періодично переглядати цю сторінку для ознайомлення з актуальною інформацією про нашу Політику конфіденційності.'},
    {title: `Зв'язок з нами`, text: `Якщо у вас є будь-які питання або пропозиції щодо нашої Політики конфіденційності, будь ласка, зв'яжіться з нами за допомогою електронної пошти: ${COMPANY_EMAIL}.`}
]

export interface ContactProps {
    text: string,
    imgLink: string
}

export interface TermItem {
    title: string,
    data: string[]
}

export const termsAndConditions : TermItem[] = [
    {
        title : '1. Загальна інформація', 
        data: [
            `1.1. Fast Coffee працює як кав'ярня, розташована в місті Запоріжжя, Україна. Наш вебсайт надає інформацію про наші продукти, послуги та акції, а також можливість зробити замовлення онлайн або дізнатися більше про наш заклад.`,
            `1.2. Використовуючи наш вебсайт, ви погоджуєтесь дотримуватись цих Умов та положень. Якщо ви не погоджуєтесь із будь-якою частиною цих умов, будь ласка, припиніть використання вебсайту.`
        ]    
    },
    {
        title : '2. Продукти та послуги',
        data: [
            `2.1. Вся інформація про продукти, їх склад та ціни вказана на нашому вебсайті. Ми докладаємо всіх зусиль, щоб забезпечити точність цієї інформації, але залишаємо за собою право вносити зміни без попереднього повідомлення.`,
            `2.2. Ціни на продукти можуть змінюватися без попереднього повідомлення. Остаточна ціна замовлення визначається на момент його оформлення.`,
            `2.3. Ми залишаємо за собою право відмовити у виконанні замовлення за будь-яких обставин, наприклад, у випадку недоступності продукту або порушення цих Умов.`
        ]
    },
    {
        title : '3. Замовлення та оплата',
        data: [
            '3.1. Оформлення замовлення на нашому сайті вимагає від вас надання точної інформації (ім’я, контактні дані, спосіб доставки тощо). Fast Coffee не несе відповідальності за будь-які наслідки, викликані наданням неправдивих або неточних даних.',
            '3.2. Оплата замовлень може здійснюватися через доступні способи оплати, зазначені на сайті. Ми забезпечуємо безпеку ваших платіжних даних за допомогою відповідних технологій захисту.',
            '3.3. У разі будь-яких помилок або непорозумінь щодо вашого замовлення, будь ласка, зв’яжіться з нами якомога швидше для їх виправлення.'
        ]
    },
    {
        title : '4. Доставка та отримання',
        data: [
            '4.1. Час доставки залежить від місця розташування та доступності продуктів. Ми не можемо гарантувати точний час доставки, але робимо все можливе, щоб доставити ваше замовлення вчасно.',
            `4.2. Замовлення можна отримати у нашій кав'ярні або замовити доставку через сторонні служби доставки (якщо така опція доступна).`,
            `4.3. Fast Coffee не несе відповідальності за затримки в доставці, спричинені діями або недоліками сторонніх служб доставки.`
        ]
    },
    {
        title: '5. Політика повернення',
        data: [
            `5.1. Повернення та відшкодування за продукти можливі лише у випадку їх неналежної якості. Якщо ви вважаєте, що ваш продукт був доставлений з дефектом або не відповідає опису, будь ласка, зв'яжіться з нами протягом 24 годин після отримання замовлення.`,
            `5.2. Всі скарги щодо якості продуктів розглядаються індивідуально.`
        ]
    },
    {
        title: '6. Конфіденційність',
        data: [
            `6.1. Ми дбаємо про захист ваших персональних даних. Вся інформація, яку ви надаєте під час оформлення замовлення або використання вебсайту, обробляється відповідно до нашої Політики конфіденційності.`,
            `6.2. Ми не передаємо ваші особисті дані третім особам без вашої згоди, за винятком випадків, передбачених законодавством.`
        ]
    },
    {
        title: '7. Обмеження відповідальності',
        data: [
            `7.1. Fast Coffee не несе відповідальності за будь-які прямі або непрямі збитки, пов'язані з використанням нашого вебсайту або продукції, придбаної через нього, за винятком випадків, передбачених законодавством.`,
            `7.2. Ми не гарантуємо безперебійної роботи сайту і не несемо відповідальності за технічні збої, що можуть вплинути на роботу сайту або процес оформлення замовлення.`
        ]
    },
    {
        title: `8. Зміни до умов`,
        data: [
            `8.1. Ми залишаємо за собою право вносити зміни до цих Умов та положень в будь-який час. Актуальна версія Умов завжди буде доступна на нашому вебсайті.`,
            `8.2. Продовжуючи користуватися нашим вебсайтом після внесення змін, ви автоматично погоджуєтесь із новими Умовами.`
        ]
    },
    {
        title: '9. Контакти',
        data: [
            `Якщо у вас виникли будь-які питання або зауваження щодо цих Умов, будь ласка, зв'яжіться з нами за допомогою наступної контактної інформації:`
        ]
    }
]

export const CONTACTS : ContactProps[] = [
    {imgLink: phoneIcon, text: '+38 (061) 543-81-76'}, 
    {imgLink: emailIcon, text: COMPANY_EMAIL},
    {imgLink: locationIcon, text: "м. Запоріжжя \n\ вул. Миру, 10"}
]